package rakeja

var defaultPos4ContentWords = []string{
	Noun,
	Verb,
	Adjective,
}

var defaultStopWords = []string{
	"あの", "あれら", "ある", "い", "いる", "および",
	"か", "が", "かつ", "かも", "から", "こと", "この", "これ", "これら",
	"しかし", "その", "その後", "そのため", "そして", "それ", "それら",
	"だ", "だから", "だけ", "対して", "た", "たち", "ため", "ついて", "て", "で", "でし", "です", "できる", "でも", "と", "ところが", "ともに", "どちら", "どの", "どこ", "どれ", "どれら",
	"ながら", "なし", "な", "なり", "なる", "に", "の", "のち",
	"は", "へ",
	"ます", "また", "または", "まで", "も", "もちろん", "もしくは",
	"や", "やり", "よう", "より",
	"を",
}

var defaultPhraseDelimiters = []string{
	"、", "。", "！", "？", "!", "?", "\n", "\r\n", "\r", "\t",
}
